{
  "backend/main.mo": "Empty Motoko actor serving as a minimal backend placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting six implemented features for Proxima Academy website including navigation branding, hero section, about page, courses page, why-choose-us page, and contact page with high confidence mappings to source files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the React application structure, components, pages, and styling for Proxima Academy coaching institute website with routing, forms, testimonials, FAQs, and SEO optimization.",
  "frontend/index.css": "Tailwind CSS base styles defining design tokens using OKLCH color system with light and dark theme variables for background, foreground, primary, secondary, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with SEO-optimized meta tags for Proxima Academy coaching classes in Bhayandar East, targeting 8th-12th grade Science and Commerce students with keywords and description.",
  "frontend/src/App.tsx": "Root application component configuring QueryClient, InternetIdentityProvider, and TanStack Router with five routes (Home, About, Courses, Why Choose Us, Contact) wrapped in Layout component.",
  "frontend/src/components/FAQSection.tsx": "Collapsible accordion component displaying eight frequently asked questions about admission process, batch size, board exam preparation, early bird discount, study materials, differentiators, stream batches, and parent communication.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Fixed floating button in bottom-right corner that opens WhatsApp chat with pre-filled inquiry message to phone number 9137201158 with hover tooltip and pulse animation.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column grid displaying academy description, quick navigation links, contact information (Bhayandar East address and phone 9137201158), copyright notice, and caffeine.ai attribution with UTM parameters.",
  "frontend/src/components/InquiryForm.tsx": "React form component for student inquiries with fields for name, phone, email, course selection, and message. Includes client-side validation and simulated submission with success/error states.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navigation, Footer, FloatingWhatsAppButton, and uses TanStack Router's Outlet for page content.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with academy branding, desktop/mobile menu toggle, and active route highlighting for Home, About, Courses, Why Choose Us, and Contact pages.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays a grid of six student and parent testimonials with 5-star ratings, names, roles, and feedback text in styled cards.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently empty as backend queries are not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a blue and gold theme, including light/dark mode support and Google Fonts (Poppins, Inter) imports.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying academy journey, vision/mission statements, and structured content about Proxima Academy's educational philosophy and location in Bhayandar East, Mumbai.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying Proxima Academy's location, phone number, office hours, and an inquiry form. Includes a WhatsApp button that opens a chat with a pre-filled admissions inquiry message.",
  "frontend/src/pages/CoursesPage.tsx": "Courses page showcasing Proxima Academy's programs including 8th-10th Foundation covering Math, Science, English, and Social Studies with concept clarity and board exam preparation features.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section with 50% early bird offer, admissions announcement for 2026-27, about section, focus areas, testimonials, and FAQ. Includes WhatsApp integration for free counseling bookings.",
  "frontend/src/pages/WhyChooseUsPage.tsx": "Page highlighting Proxima Academy's key differentiators including concept clarity, small batch sizes, and personalized attention with detailed explanations and feature lists.",
  "frontend/src/utils/whatsapp.ts": "Utility function that generates WhatsApp web links with formatted Indian phone numbers and optional pre-filled messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, animations, shadows, and custom font families (Inter and Poppins).",
  "project_state.json": "Project state file tracking the Proxima Academy coaching institute website with blue/gold branding, multi-page structure (Home, About, Courses, Why Choose Us, Contact), and features including responsive design, WhatsApp integration, testimonials, FAQ, and SEO optimization. Contains architectural notes, feature tracking with requirement IDs, image requirements, and file structure metadata."
}